<a href="https://colab.research.google.com/github/Melvinmcrn/DataScience/blob/master/Lect2/tutorial_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

#### Create a series

In [0]:
name = pd.Series(['Adam','Bob','Dave','Emily'])

In [3]:
name

0     Adam
1      Bob
2     Dave
3    Emily
dtype: object

In [4]:
name.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
name.values

array(['Adam', 'Bob', 'Dave', 'Emily'], dtype=object)

In [6]:
name

0     Adam
1      Bob
2     Dave
3    Emily
dtype: object

In [7]:
name[0]

'Adam'

In [0]:
age = pd.Series([15,16,16,15])

In [9]:
age

0    15
1    16
2    16
3    15
dtype: int64

In [0]:
age.index = name

In [11]:
age.index

Index(['Adam', 'Bob', 'Dave', 'Emily'], dtype='object')

In [12]:
age

Adam     15
Bob      16
Dave     16
Emily    15
dtype: int64

In [13]:
age['Adam']

15

#### Create a dataframe

In [0]:
name = pd.Series(['Adam','Bob','Dave','Emily'])
age = pd.Series([15,16,16,15])
gender = pd.Series(['M','M','M','F'])
students = pd.DataFrame({'Name':name, 'Age':age, 'Gender':gender})

In [15]:
students

    Name  Age Gender
0   Adam   15      M
1    Bob   16      M
2   Dave   16      M
3  Emily   15      F

In [0]:
students = pd.DataFrame({'Name':['Adam','Bob','Dave','Emily'], 
                         'Age':[15,16,16,15], 
                         'Gender':['M','M','M','F']})

In [17]:
students

    Name  Age Gender
0   Adam   15      M
1    Bob   16      M
2   Dave   16      M
3  Emily   15      F

#### Index

In [0]:
students.index = students['Name']

In [19]:
students

        Name  Age Gender
Name
Adam    Adam   15      M
Bob      Bob   16      M
Dave    Dave   16      M
Emily  Emily   15      F

In [0]:
students.set_index('Name', inplace=True)

In [21]:
students

       Age Gender
Name
Adam    15      M
Bob     16      M
Dave    16      M
Emily   15      F

#### Indexing

In [22]:
students['Age']

Name
Adam     15
Bob      16
Dave     16
Emily    15
Name: Age, dtype: int64

In [23]:
students.loc['Adam']

Age       15
Gender     M
Name: Adam, dtype: object

In [24]:
students.iloc[0]

Age       15
Gender     M
Name: Adam, dtype: object

In [25]:
students.loc['Adam','Age']

15

In [26]:
students[['Age','Gender']]

       Age Gender
Name
Adam    15      M
Bob     16      M
Dave    16      M
Emily   15      F

In [27]:
students.loc[['Adam','Bob']]

      Age Gender
Name
Adam   15      M
Bob    16      M

In [28]:
students.iloc[0:2]

      Age Gender
Name
Adam   15      M
Bob    16      M

In [29]:
students.loc[['Adam','Bob'],['Gender','Age']]

     Gender  Age
Name
Adam      M   15
Bob       M   16

#### Adding rows

In [0]:
students.loc['Fred'] = [16, 'M']

In [31]:
students

       Age Gender
Name
Adam    15      M
Bob     16      M
Dave    16      M
Emily   15      F
Fred    16      M

In [32]:
students2 = pd.DataFrame({'Age':[16,15], 
                         'Gender':['F','M']}, index=['Grace', 'Henry'])
students2

       Age Gender
Grace   16      F
Henry   15      M

In [0]:
students = students.append(students2)

In [34]:
students

       Age Gender
Adam    15      M
Bob     16      M
Dave    16      M
Emily   15      F
Fred    16      M
Grace   16      F
Henry   15      M

#### Add a column

In [0]:
students['Height'] = [170, 167, 172, 163, 165, 158, 175]

In [36]:
students

       Age Gender  Height
Adam    15      M     170
Bob     16      M     167
Dave    16      M     172
Emily   15      F     163
Fred    16      M     165
Grace   16      F     158
Henry   15      M     175

#### Remove rows or columns

In [37]:
students.drop(['Bob','Grace'])

       Age Gender  Height
Adam    15      M     170
Dave    16      M     172
Emily   15      F     163
Fred    16      M     165
Henry   15      M     175

In [38]:
students.drop(['Age','Height'], axis=1)

      Gender
Adam       M
Bob        M
Dave       M
Emily      F
Fred       M
Grace      F
Henry      M

## Analyzing IMDb Movies Data

In [39]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv")

FileNotFoundError: ignored

In [0]:
movies_df.head()

In [0]:
movies_df = movies_df.set_index("Title")
movies_df.head(2)

In [0]:
movies_df = movies_df.reset_index()
movies_df.head(2)

In [0]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv", index_col='Title')

In [0]:
movies_df.head()

In [0]:
movies_df.shape

In [0]:
movies_df.info()

#### Rename columns

In [0]:
movies_df.columns

In [0]:
movies_df.rename(columns={
        'Runtime (Minutes)': 'Runtime', 
        'Revenue (Millions)': 'Revenue'
    }, inplace=True)

In [0]:
movies_df.columns

#### Select columns

In [0]:
type(movies_df['Genre'])

In [0]:
movies_df['Genre']

In [0]:
type(movies_df[['Genre']])

In [0]:
type(movies_df[['Genre','Rating']])

In [0]:
movies_df[['Genre','Rating']]

#### Select rows

In [0]:
type(movies_df.loc["Prometheus"])

In [0]:
movies_df.loc["Prometheus"]

In [0]:
type(movies_df.loc[["Prometheus"]])

In [0]:
type(movies_df.loc[["Prometheus","Suicide Squad"]])

In [0]:
movies_df.loc[["Prometheus","Suicide Squad"]]

#### Select rows and columns

In [0]:
movies_df.loc[["Prometheus","Suicide Squad"],["Genre","Rating"]]

In [0]:
movies_df.iloc[[1,4],[1,7]]

#### Missing data

In [0]:
movies_df.isnull()

In [0]:
movies_df.isnull().sum()

In [0]:
movies_df.fillna(0).isnull().sum()

In [0]:
movies_df.fillna(0).shape

In [0]:
movies_df2 = movies_df.dropna()

In [0]:
movies_df2.shape

In [0]:
movies_df.dropna(inplace=True)

In [0]:
movies_df.shape

#### Statistics functions

In [0]:
movies_df.mean()

In [0]:
movies_df.quantile(0.25)

In [0]:
movies_df.describe()

In [0]:
movies_df[["Genre","Description","Director","Actors"]].describe()

In [0]:
movies_df.select_dtypes("object").describe()

#### Conditional selection

In [0]:
movies_df['Director']=="Ridley Scott"

In [0]:
movies_df[movies_df['Director']=="Ridley Scott"]

In [0]:
movies_df[movies_df['Director'].isin(['Christopher Nolan', 'Ridley Scott'])].head()

In [0]:
movies_df[movies_df['Rating'] >= 9]

In [0]:
movies_df[
    ((movies_df['Year'] >= 2005) & (movies_df['Year'] <= 2010))
    & (movies_df['Rating'] > 8.0)
    & (movies_df['Revenue'] < movies_df['Revenue'].quantile(0.25))
]

#### apply()

In [0]:
def rating_function(x):
    if x >= 8.0:
        return "good"
    else:
        return "bad"

In [0]:
movies_df["Rating"].apply(rating_function)

In [0]:
movies_df["Rating_category"] = movies_df["Rating"].apply(rating_function)

In [0]:
movies_df.head()

In [0]:
movies_df["Rating_category"] = movies_df["Rating"].apply(lambda x: 'good' if x >= 8.0 else 'bad')
movies_df.head()

#### apply() with a lambda function

In [0]:
movies_df["Actors"] = movies_df["Actors"].apply(lambda x: x.split(sep=','))

In [0]:
movies_df.head()

In [0]:
movies_df[movies_df['Actors'].apply(lambda x: "Chris Pratt" in x)]

#### sort

In [0]:
movies_df.sort_values(by="Title").head()

In [0]:
movies_df.sort_values(by=["Year","Revenue"], ascending=False).head()

#### Group by

In [0]:
groups = movies_df.reset_index().groupby("Year")
type(groups)

In [0]:
groups.size()

In [0]:
groups["Revenue"].describe()

In [0]:
max_revenue_index = groups[["Revenue"]].idxmax()["Revenue"]
max_revenue_index

In [0]:
movies_df.iloc[max_revenue_index,]["Year"]

#### Plot

In [0]:
import matplotlib.pyplot as plt

In [0]:
movies_df.plot(kind='scatter', x='Rating', y='Revenue', title='Revenue vs Rating');

In [0]:
movies_df['Rating'].plot(kind='hist', title='Rating');